In [3]:
import pandas as pd
records1 = pd.Series({"Name":"Alice","Class":"Physics","Score":85})
records2 = pd.Series({"Name":"Jack","Class":"Chemistry","Score":82})
records3 = pd.Series({"Name":"Molly","Class":"Biology","Score":90})
df = pd.DataFrame([records1,records2,records3],index=["school1","school2","school1"])
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Molly    Biology     90

In [4]:
students = [{"Name":"Alice","Class":"Physics","Score":85},
                     {"Name":"Jack","Class":"Chemistry","Score":82},
                    {"Name":"Helen","Class":"Biology","Score":90}
                    ]
df = pd.DataFrame(students, index=["school1","school2","school1"])
df.head()

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [5]:
df.loc["school2"]

Name          Jack
Class    Chemistry
Score           82
Name: school2, dtype: object

In [6]:
copy_df = df.copy()
copy_df.drop("Name", inplace=True,axis=1)
copy_df

             Class  Score
school1    Physics     85
school2  Chemistry     82
school1    Biology     90

In [7]:
df

          Name      Class  Score
school1  Alice    Physics     85
school2   Jack  Chemistry     82
school1  Helen    Biology     90

In [8]:
copy_df

             Class  Score
school1    Physics     85
school2  Chemistry     82
school1    Biology     90

In [9]:
import pandas as pd
df=pd.read_csv('dataset/student.csv')
df.head()

   id        name  class  mark  gender
0   1    John Deo   Four    75  female
1   2    Max Ruin  Three    85    male
2   3      Arnold  Three    55    male
3   4  Krish Star   Four    60  female
4   5   John Mike   Four    60  female

In [10]:
df=pd.read_csv('dataset/student.csv',index_col=0)
df.head()

          name  class  mark  gender
id
1     John Deo   Four    75  female
2     Max Ruin  Three    85    male
3       Arnold  Three    55    male
4   Krish Star   Four    60  female
5    John Mike   Four    60  female

In [11]:
new_df = df.rename(columns={'mark':"StudentMarks","gender":"StudentGender"})
new_df.head()

          name  class  StudentMarks StudentGender
id
1     John Deo   Four            75        female
2     Max Ruin  Three            85          male
3       Arnold  Three            55          male
4   Krish Star   Four            60        female
5    John Mike   Four            60        female

In [12]:
new_df.columns

Index(['name', 'class', 'StudentMarks', 'StudentGender'], dtype='object')

In [13]:
admit_nextgrade=new_df["StudentMarks"]>70
admit_nextgrade

id
1      True
2      True
3     False
4     False
5     False
6     False
7      True
8      True
9      True
10    False
11     True
12     True
13     True
14     True
15     True
16     True
17    False
18     True
19    False
20    False
21    False
22    False
23     True
24     True
25     True
26     True
27     True
28     True
29    False
30     True
31     True
32     True
33     True
34    False
35     True
Name: StudentMarks, dtype: bool

In [14]:
df.where(admit_nextgrade).head()

        name  class  mark  gender
id
1   John Deo   Four  75.0  female
2   Max Ruin  Three  85.0    male
3        NaN    NaN   NaN     NaN
4        NaN    NaN   NaN     NaN
5        NaN    NaN   NaN     NaN

In [15]:
df.where(admit_nextgrade).dropna().head()

           name  class  mark  gender
id
1      John Deo   Four  75.0  female
2      Max Ruin  Three  85.0    male
7   My John Rob  Fifth  78.0    male
8        Asruid   Five  85.0    male
9       Tes Qry    Six  78.0    male

In [1]:
import pandas as pd
import math
sdata = {'Ohio': 35000, 'Texas': 71000, 'Oregon': 16000, 'Utah': 5000}
obj1 = pd.Series(sdata)
states = ['California', 'Ohio', 'Oregon', 'Texas']
obj2 = pd.Series(sdata, index=states)
obj3 = pd.isnull(obj2)
# obj3['California']
# math.isnan(obj2['California'])
obj2['California'] == None
# x = obj2['California']
# obj2['California'] != x

False

In [17]:
import pandas as pd
d = {'1': 'Alice','2': 'Bob','3': 'Rita','4': 'Molly','5': 'Ryan'}
S = pd.Series(d)
S.iloc[0:3]

1    Alice
2      Bob
3     Rita
dtype: object

In [18]:
df.head()

          name  class  mark  gender
id
1     John Deo   Four    75  female
2     Max Ruin  Three    85    male
3       Arnold  Three    55    male
4   Krish Star   Four    60  female
5    John Mike   Four    60  female

In [19]:
df=df.rename(mapper=lambda x:x.upper(),axis='columns')

In [20]:
df.head()

          NAME  CLASS  MARK  GENDER
id
1     John Deo   Four    75  female
2     Max Ruin  Three    85    male
3       Arnold  Three    55    male
4   Krish Star   Four    60  female
5    John Mike   Four    60  female

In [2]:
import pandas as pd
s1 = pd.Series({1: 'Alice', 2: 'Jack', 3: 'Molly'})
s2 = pd.Series({'Alice': 1, 'Jack': 2, 'Molly': 3})
s2[1]

/var/folders/y9/kswx7vmd4qq__6lg8px9jl3r0000gn/T/ipykernel_33997/2409800886.py:4: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  s2[1]

np.int64(2)

In [3]:
s2.iloc[1]

np.int64(2)

In [4]:
s1.loc[1]

'Alice'

In [5]:
s2.loc[1]

KeyError: 1